/**
 * 유저 정보 수집 시 활용 데이터
 * @author 현웅
 */
export const Jobs = [
  "중/고등학생",
  "대학(원)생",
  "풀타임 직장인 (공무원, 전문직 포함)",
  "파트타임 직장인",
  "프리랜서",
  "자영업자",
  "전업주부",
  "무직 및 기타",
];

export const Occupations = [
  "직장인이 아님",
  "기획/전략",
  "마케팅, PR",
  "재무, 회계",
  "IT 개발",
  "데이터",
  "경영일반, 사무",
  "인사, 노무",
  "영업",
  "고객상담",
  "디자인",
  "금융, 투자",
  "상품기획/MD",
  "법률, 법무",
  "연구개발",
  "자영업",
];

export const Residences = [
  "서울특별시",
  "부산광역시",
  "대구광역시",
  "인천광역시",
  "광주광역시",
  "대전광역시",
  "울산광역시",
  "세종특별자치시",
  "경기도",
  "충청북도",
  "충청남도",
  "전라북도",
  "전라남도",
  "경상북도",
  "경상남도",
];

export const EntertainmentArtInterests = [
  "문학/예술",
  "영화",
  "드라마",
  "미술/디자인",
  "공연/전시",
  "음악",
];

export const FitnessActivityInterests = [
  "러닝/산책",
  "수영",
  "쇼트트랙",
  "필라테스",
  "스카이 다이빙",
  "축구",
  "농구",
  "야구",
];

export const CareerInterests = [
  "개발",
  "디자인",
  "기획",
  "마케팅",
  "스타트업",
  "데이터분석",
  "서비스",
];

export const Influxes = [
  "인스타그램 광고",
  "평소 스타트업에 관심이 있어서",
  "평소 리서치에 관심이 있어서",
  "지인 추천",
  "리서치를 올리기 위해서",
  "기타",
];
