import React from "react";
import Svg, { Path } from "react-native-svg";

/**
 * 투표 상세 페이지에서 사용되는 검은색의 작은 스크랩 아이콘.
 * 스크랩 된 경우 검은색을 채웁니다.
 * @author 현웅
 */
export function ScrapSmallIcon({ scrapped }: { scrapped: boolean }) {
  return (
    <Svg width="15" height="16" viewBox="0 0 15 16" fill="none">
      <Path
        d="M3 6.08107C3 4.15724 3 3.19532 3.49426 2.59766C3.98851 2 4.78401 2 6.375 2H8.625C10.216 2 11.0115 2 11.5057 2.59766C12 3.19532 12 4.15724 12 6.08107V10.7251C12 12.5502 12 13.4627 11.5251 13.7419C11.0502 14.021 10.4568 13.4572 9.26993 12.3296L8.8901 11.9687C8.22276 11.3347 7.8891 11.0177 7.5 11.0177C7.1109 11.0177 6.77724 11.3347 6.1099 11.9687L5.73007 12.3296C4.54324 13.4572 3.94983 14.021 3.47492 13.7419C3 13.4627 3 12.5502 3 10.7251V6.08107Z"
        fill={scrapped ? "#333333" : "none"}
        stroke="#333333"
        stroke-width="1.00676"
      />
    </Svg>
  );
}
